In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#Loading in the data
calendar_df = pd.read_csv('../Data/calendar.csv',parse_dates=['date'])
reviews_df = pd.read_csv('../Data/reviews.csv',parse_dates=['date'])

In [17]:
#I am only interested in the data that is available 
#Additionally, I only need the price and the date
cal_df = calendar_df[calendar_df['available'] == 't'].drop(['listing_id','available'],axis=1)

In [ ]:
#I want to see the amount of listings both on a monthly basis and day of the week
#So I will add columns to help with this

In [7]:
calendar_df.sample(5)

         listing_id       date available    price
1359283     7217102 2016-01-27         t  $232.00
186998      6262987 2016-05-01         f      NaN
442698      5736082 2016-11-17         t   $45.00
250621       977722 2016-08-22         f      NaN
1211772     9675736 2016-12-06         f      NaN

In [10]:
len(calendar_df['date'])

1393570

In [12]:
len(cal_df)

934542

In [13]:
cal_df.sample(5)

        listing_id       date available    price
390649     3385421 2016-04-12         t  $557.00
535823     9863312 2016-01-07         t   $99.00
991379     9494946 2016-02-12         t   $89.00
564946     2191169 2016-10-21         t  $291.00
863007     1827586 2016-05-30         t  $375.00

In [14]:
cal_df_2 = calendar_df[calendar_df['available'] == 't'].drop(['listing_id','available'],axis=1)

In [15]:
cal_df_2.sample(5)

              date    price
362271  2016-07-13  $225.00
892466  2016-02-14   $63.00
567602  2016-01-31  $100.00
1271910 2016-09-10   $85.00
153952  2016-10-17   $40.00